Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>SMTPСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортPOP3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяSMTPАутентификация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОставлятьКопииСообщенийНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьПисьмаССервераЧерез</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейУдаленияПисемССервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаВходящие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИсходящие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаУдаленные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЧерновики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПисемЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТекстаПисьмаПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьПодписьКИсходящимПисьмам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьПодписьКОтветамИПересылкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоПолучениеОтправкаСообщений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтоПолученияОтправкиСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаАвтоПолучениеОтправкуСообщений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПомещатьОтветыИПереадресацииВТужеГруппу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеАвтополученияОтправкиСообщений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтоматическойУстановкиОтметкиРассмотрено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКлассификациюПисемПоПредметам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьПустойПредметДляНовыхПисемИзТемыПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьПредмет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьОснованиеНовогоПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтосохранениеПисем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтосохраненияПисем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматПисьмаДляОтветовИПереадресацийБратьИзИсходного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотреноПриОтвете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотреноПриПолученииОтвета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВходящихОтветовИПереадресацийИскатьПисьмаОснованияИЗаполнятьГруппуПисемНовогоПисьма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкаПисемПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодировкуПисьмаДляОтветовБратьИзИсходного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступКУчетнойЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьОтправка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьТранспорт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Администрирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Запись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчетныеЗаписиЭлектроннойПочты/Ext/ObjectModule.bsl
Перем мНовыеГруппы;

// Функция выполняет проверку реквизитов объекта, обязательных для заполнения.
//
// Возвращаемое значение:
//   Строка - описание не заполненных полей.
//
Функция ПроверитьЗаполнениеОбязательныхПолей() Экспорт

	ТекстОшибок = "";
	
	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + НСтр("ru='Не указан адрес (E-mail) учетной записи.';uk='Не зазначена адреса (E-mail) облікового запису.'");
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(SMTPСервер) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + НСтр("ru='Не указано имя SMTP сервера.';uk=""Не зазначене ім'я SMTP сервера.""");
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(ПортSMTP) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + НСтр("ru='Не указан порт SMTP сервера.';uk='Не зазначений порт SMTP сервера.'");
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(POP3Сервер) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + НСтр("ru='Не указано имя POP3 сервера.';uk=""Не зазначене ім'я POP3 сервери.""");
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(ПортPOP3) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + НСтр("ru='Не указан порт POP3 сервера.';uk='Не зазначений порт POP3 сервери.'");
	КонецЕсли; 

	Если НЕ ЗначениеЗаполнено(Логин) Тогда
		ТекстОшибок = ТекстОшибок + Символы.ПС + НСтр("ru='Не указано имя пользователя для доступа к почтовому серверу.';uk=""Не зазначене ім'я користувача для доступу до поштового сервера.""");
	КонецЕсли;
	
	Возврат СокрЛП(ТекстОшибок);

КонецФункции

// Функция определяет, есть ли ссылки в документах ЭлектронноеПисьмо
//  на группу записей электронных писем
//
// Параметры
//  ГруппаУчетнойЗаписи - СправочникСсылка.ГруппыПисемУчетнойЗаписи
//
// Возвращаемое значение:
//   Булево, если есть ссылки
//
Функция ЕстьСсылки(ГруппаУчетнойЗаписи)

	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЭлектронноеПисьмо.Ссылка
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	|ГДЕ
	|	ЭлектронноеПисьмо.ГруппаУчетнойЗаписи = &ГруппаУчетнойЗаписи
	|";
	
	Запрос.УстановитьПараметр("ГруппаУчетнойЗаписи", ГруппаУчетнойЗаписи);
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

// Процедура, обработчик события ПередЗаписью объекта
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
	
		СтрокаОшибки = НСтр("ru='Учетная запись ""';uk='Обліковий запис ""'") + Наименование + "<" + АдресЭлектроннойПочты + ">" + НСтр("ru=' не записана.';uk=' не записана.'");
		
		мНовыеГруппы = Неопределено;
		
		Если НЕ Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить() Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='В настройках учета не установлено использование встроенного почтового клиента.';uk='У настройках обліку не встановлене використання убудованого поштового клієнта.'"),, СтрокаОшибки);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указано представление учетной записи.';uk='Не зазначене представлення облікового запису.'"),, СтрокаОшибки);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГруппаУдаленные) И ЕстьСсылки(ГруппаУдаленные) Тогда
			ОбщегоНазначения.СообщитьОбОшибке((НСтр("ru='В группе ""';uk='У групі ""'") + ГруппаУдаленные + НСтр("ru='"" есть электронные письма. Данную группу нельзя устанавливать в качестве группы удаленных писем.';uk='"" є електронні листи. Дану групу не можна встановлювати як групу вилучених листів.'")),, СтрокаОшибки);
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ГруппаЧерновики) И ЕстьСсылки(ГруппаЧерновики) Тогда
			ОбщегоНазначения.СообщитьОбОшибке((НСтр("ru='В группе ""';uk='У групі ""'") + ГруппаЧерновики + НСтр("ru='"" есть электронные письма. Данную группу нельзя устанавливать в качестве группы черновиков.';uk='"" є електронні листи. Дану групу не можна встановлювати як групу чернеток.'")),, СтрокаОшибки);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ЭтоНовый() Тогда
			
			УстановитьСсылкуНового(Справочники.УчетныеЗаписиЭлектроннойПочты.ПолучитьСсылку(Новый УникальныйИдентификатор));
			
			мНовыеГруппы = Истина;
			ЭтотОбъект.ГруппаВходящие  = Справочники.ГруппыПисемЭлектроннойПочты.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ЭтотОбъект.ГруппаИсходящие = Справочники.ГруппыПисемЭлектроннойПочты.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ЭтотОбъект.ГруппаУдаленные = Справочники.ГруппыПисемЭлектроннойПочты.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ЭтотОбъект.ГруппаЧерновики = Справочники.ГруппыПисемЭлектроннойПочты.ПолучитьСсылку(Новый УникальныйИдентификатор);
			
		Иначе
			
			
			Если ИспользоватьКлассификациюПисемПоПредметам <> Ссылка.ИспользоватьКлассификациюПисемПоПредметам Тогда
				
				Выборка = Справочники.ГруппыПисемЭлектроннойПочты.Выбрать(, Ссылка);
				
				Пока Выборка.Следующий() И НЕ Отказ Цикл
				
					Объект = Выборка.ПолучитьОбъект();
					Объект.ИспользоватьПредметыПисем = ЭтотОбъект.ИспользоватьКлассификациюПисемПоПредметам;
					Попытка
						Объект.Записать();
					Исключение
						ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, СтрокаОшибки);
						Отказ = Истина;
					КонецПопытки;
				
				КонецЦикла; 
				
			КонецЕсли;

		КонецЕсли; 
		
		// Проверим предопределенные группы, в них не должно быть одинаковых значений
		ТаблицаПроверкиГрупп = Новый ТаблицаЗначений;
		ТаблицаПроверкиГрупп.Колонки.Добавить("Группа");
		ТаблицаПроверкиГрупп.Колонки.Добавить("Количество");
		
		Если ЗначениеЗаполнено(ГруппаВходящие) Тогда
			НоваяСтрока = ТаблицаПроверкиГрупп.Добавить();
			НоваяСтрока.Группа     = ГруппаВходящие;
			НоваяСтрока.Количество = 1;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ГруппаИсходящие) Тогда
			НоваяСтрока = ТаблицаПроверкиГрупп.Добавить();
			НоваяСтрока.Группа     = ГруппаИсходящие;
			НоваяСтрока.Количество = 1;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ГруппаУдаленные) Тогда
			НоваяСтрока = ТаблицаПроверкиГрупп.Добавить();
			НоваяСтрока.Группа     = ГруппаУдаленные;
			НоваяСтрока.Количество = 1;
		КонецЕсли; 
		Если ЗначениеЗаполнено(ГруппаЧерновики) Тогда
			НоваяСтрока = ТаблицаПроверкиГрупп.Добавить();
			НоваяСтрока.Группа     = ГруппаЧерновики;
			НоваяСтрока.Количество = 1;
		КонецЕсли;
		
		Если ТаблицаПроверкиГрупп.Количество() > 0 Тогда
			ТаблицаПроверкиГрупп.Свернуть("Группа", "Количество");
			Для каждого СтрокаТаблицы Из ТаблицаПроверкиГрупп Цикл
				Если СтрокаТаблицы.Количество > 1 Тогда
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='У предопределенных групп Входящие, Исходящие, Удаленные и Черновики не должно быть повторяющихся значений.';uk='У напередвизначених груп Вхідні, Вихідні, Вилучені й Чернетки не повинно бути значень, що повторюються.'"),, СтрокаОшибки);
					Отказ = Истина;
					Возврат;
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 

		Если АвтоПолучениеОтправкаСообщений Тогда
			Если НЕ ЗначениеЗаполнено(ОтветственныйЗаАвтоПолучениеОтправкуСообщений) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указан ответственный за автополучение/отправку писем.';uk='Не зазначений відповідальний за автоотримання/відправлення листів.'"),, СтрокаОшибки);
				Отказ = Истина;
			ИначеЕсли НЕ ЗначениеЗаполнено(ИнтервалАвтоПолученияОтправкиСообщений) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Не указан интервал автополучения/отправки писем.';uk='Не зазначений інтервал автоотримання/відправлення листів.'"),, СтрокаОшибки);
				Отказ = Истина;
			Иначе
				СтрокаТЧ = ДоступКУчетнойЗаписи.Найти(ОтветственныйЗаАвтоПолучениеОтправкуСообщений, "Пользователь");
				Если СтрокаТЧ = Неопределено Тогда
					Отказ = Истина;
				Иначе
					Если НЕ СтрокаТЧ.Запись Тогда
						Отказ = Истина;
					КонецЕсли; 
				КонецЕсли; 
				Если Отказ Тогда
					ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='У ответственного за автополучение/отправку нет прав на запись писем.';uk='У відповідального за автоотримання/відправлення немає прав на запис листів.'"),, СтрокаОшибки);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 

		Если НЕ ПометкаУдаления Тогда
			Проверка = СокрЛП(ПроверитьЗаполнениеОбязательныхПолей());
			Если ЗначениеЗаполнено(Проверка) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(Проверка,, СтрокаОшибки);
				Отказ = Истина;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура, обработчик события ПриЗаписи объекта
//
Процедура ПриЗаписи(Отказ)
	
	Если мНовыеГруппы = Истина И НЕ ОбменДанными.Загрузка Тогда
	
		СтрокаОшибки = НСтр("ru='Учетная запись ""';uk='Обліковий запис ""'") + Наименование + "<" + АдресЭлектроннойПочты + ">" + НСтр("ru=' не записана.';uk=' не записана.'");
		
		// Входящие
		НовыйОбъект = Справочники.ГруппыПисемЭлектроннойПочты.СоздатьЭлемент();
		НовыйОбъект.УстановитьСсылкуНового(ГруппаВходящие);
		НовыйОбъект.Владелец                  = Ссылка;
		НовыйОбъект.Наименование              = "Входящие";
		НовыйОбъект.ИспользоватьПредметыПисем = ИспользоватьКлассификациюПисемПоПредметам;
		Попытка
			НовыйОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, СтрокаОшибки);
			Отказ = Истина;
		КонецПопытки;
		
		// Исходящие
		НовыйОбъект = Справочники.ГруппыПисемЭлектроннойПочты.СоздатьЭлемент();
		НовыйОбъект.УстановитьСсылкуНового(ГруппаИсходящие);
		НовыйОбъект.Владелец                  = Ссылка;
		НовыйОбъект.Наименование              = "Исходящие";
		НовыйОбъект.ИспользоватьПредметыПисем = ИспользоватьКлассификациюПисемПоПредметам;
		Попытка
			НовыйОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, СтрокаОшибки);
			Отказ = Истина;
		КонецПопытки;
		
		// Удаленные
		НовыйОбъект = Справочники.ГруппыПисемЭлектроннойПочты.СоздатьЭлемент();
		НовыйОбъект.УстановитьСсылкуНового(ГруппаУдаленные);
		НовыйОбъект.Владелец                  = Ссылка;
		НовыйОбъект.Наименование              = "Удаленные";
		НовыйОбъект.ИспользоватьПредметыПисем = ИспользоватьКлассификациюПисемПоПредметам;
		Попытка
			НовыйОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, СтрокаОшибки);
			Отказ = Истина;
		КонецПопытки;
		
		// Черновики
		НовыйОбъект = Справочники.ГруппыПисемЭлектроннойПочты.СоздатьЭлемент();
		НовыйОбъект.УстановитьСсылкуНового(ГруппаЧерновики);
		НовыйОбъект.Владелец                  = Ссылка;
		НовыйОбъект.Наименование              = "Черновики";
		НовыйОбъект.ИспользоватьПредметыПисем = ИспользоватьКлассификациюПисемПоПредметам;
		Попытка
			НовыйОбъект.Записать();
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, СтрокаОшибки);
			Отказ = Истина;
		КонецПопытки;
	
	КонецЕсли; 
	
КонецПроцедуры
